{"_id": "meetingType.threeAmigos", "_type": "meetingType", "name": "Three Amigos", "description": "Product Owner, Developer, and QA collaborate to clarify requirements and define acceptance criteria.", "defaultGoal": "Refine the user story into well-defined acceptance criteria and identify gaps.", "defaultInstructions": "Discuss story details from business, development, and QA perspectives. Ask clarifying questions, propose Gherkin acceptance criteria, and confirm Definition of Ready."}
{"_id": "meetingType.backlogRefinement", "_type": "meetingType", "name": "Backlog Refinement", "description": "The team reviews upcoming work to ensure stories are clear, estimated, and prioritized.", "defaultGoal": "Prepare backlog items so they are ready for sprint planning.", "defaultInstructions": "Review stories, split large items, add missing details, clarify scope, and ensure acceptance criteria are testable."}
{"_id": "meetingType.planningPoker", "_type": "meetingType", "name": "Planning Poker", "description": "Team members estimate effort for backlog items using consensus-based story point estimation.", "defaultGoal": "Generate reliable, shared estimates for upcoming stories.", "defaultInstructions": "Each team member proposes an estimate. Discuss differences, justify reasoning, and converge on a consensus story point."}
{"_id": "meetingType.review", "_type": "meetingType", "name": "Sprint Review", "description": "The team demonstrates completed work to stakeholders and collects feedback.", "defaultGoal": "Inspect increment and adapt backlog based on stakeholder feedback.", "defaultInstructions": "Show completed features, discuss progress towards sprint goal, gather feedback, and note follow-ups."}
{"_id": "meetingType.standUp", "_type": "meetingType", "name": "Daily Stand-up", "description": "Short daily meeting for the team to synchronize, identify blockers, and plan the next 24 hours.", "defaultGoal": "Ensure alignment and highlight blockers early.", "defaultInstructions": "Each team member answers: What did you do yesterday? What will you do today? Any blockers?"}
